import { createRosterRecord as r } from "./rosterRecord.js";

export const dragonsDefenseRoster = [
  r("groleau", "Жереми", "Гроло", "ЗАЩ", [], "1999-10-25", "Канада", 1, 1, 100, 68, 68, 76, 75, 70, 74, "односторонний", [15, 15]),
  r("ottenbreit", "Тёрнер", "Оттенбрайт", "ЗАЩ", [], "1997-07-09", "Канада", 1, 64, 100, 70, 72, 76, 75, 70, 76, "односторонний", [25, 25]),
  r("cicek", "Ник", "Чичек", "ЗАЩ", [], "2000-05-29", "Канада", 0, 0, 100, 72, 67, 80, 75, 72, 77, "односторонний", [30, 30]),
];
