import { createRosterRecord as r } from "./rosterRecord.js";

export const dragonsForwardRoster = [
  r("akolzin", "Павел", "Акользин", "ПНП", ["ЛНП"], "1990-11-25", "Россия", 10, 473, 100, 72, 77, 77, 76, 71, 75, "односторонний", [20, 20]),
  r("vladimir-kuznetsov", "Владимир", "Кузнецов", "ЛНП", ["ПНП"], "1998-02-18", "Россия", 7, 155, 100, 72, 75, 77, 76, 70, 74, "односторонний", [20, 20]),
  r("brett-murray", "Бретт", "Мюррэй", "ЛНП", ["ПНП"], "1998-07-20", "Канада", 0, 0, 100, 78, 68, 82, 76, 77, 79, "односторонний", [45, 45]),
  r("nicolas-petan", "Николас", "Петан", "ЦТР", ["ЛНП"], "1995-03-22", "Канада", 1, 47, 100, 78, 82, 70, 72, 83, 80, "односторонний", [55, 55]),
  r("nikita-popugayev", "Никита", "Попугаев", "ЛНП", ["ПНП"], "1998-11-20", "Россия", 7, 242, 100, 74, 75, 78, 76, 75, 77, "односторонний", [40, 40]),
  r("riley-sutter", "Райли", "Саттер", "ЦТР", [], "1999-10-25", "Канада", 1, 52, 100, 72, 72, 76, 76, 75, 76, "односторонний", [25, 25]),
  r("givani-smith", "Дживани", "Смит", "ПНП", ["ЛНП"], "1998-02-27", "Канада", 0, 0, 100, 68, 67, 85, 77, 70, 75, "односторонний", [25, 25]),
  r("martin-frk", "Мартин", "Фрк", "ПНП", ["ЛНП"], "1993-10-05", "Чехия", 0, 0, 100, 82, 72, 80, 74, 82, 80, "односторонний", [60, 60, 60]),
  r("david-chen", "Дэвид", "Чен", "ЦТР", ["ПНП"], "2003-04-01", "США", 0, 0, 100, 63, 60, 63, 57, 64, 72, "односторонний", [2, 2]),
];
