import { createRosterRecord as r } from "./rosterRecord.js";

export const sochiForwardRoster = [
  r("fyodor-avramov", "Федор", "Аврамов", "ЛНП", ["ПНП"], "2005-11-19", "Россия", 3, 55, 100, 68, 60, 75, 65, 69, 76, "двухсторонний", [0.5]),
  r("bashkirov", "Данил", "Башкиров", "ПНП", [], "2001-05-15", "Россия", 8, 303, 100, 71, 76, 76, 73, 72, 75, "односторонний", [22, 25]),
  r("bikmullin", "Рафаэль", "Бикмуллин", "ЦТР", ["ПНП"], "1997-07-12", "Россия", 10, 329, 100, 72, 78, 70, 71, 74, 75, "односторонний", [15]),
  r("beaudin", "Жан-Кристоф", "Боден", "ЦТР", [], "1997-03-25", "Канада", 1, 51, 100, 70, 73, 78, 76, 73, 76, "односторонний", [30]),
  r("vengryzhanovsky", "Денис", "Венгрыжановский", "ЛНП", [], "2001-05-25", "Россия", 7, 190, 100, 73, 68, 79, 74, 73, 76, "односторонний", [7]),
  r("matvei-guskov", "Матвей", "Гуськов", "ЦТР", [], "2001-01-30", "Россия", 7, 194, 100, 72, 75, 79, 75, 78, 78, "односторонний", [27, 33]),
  r("dedunov", "Павел", "Дедунов", "ПНП", ["ЛНП"], "1990-04-08", "Россия", 16, 620, 100, 69, 79, 83, 77, 69, 75, "односторонний", [25]),
  r("kagarlitsky", "Дмитрий", "Кагарлицкий", "ЛНП", [], "1989-08-01", "Россия", 18, 787, 100, 74, 72, 70, 70, 82, 76, "односторонний", [12, 20, 20]),
  r("yegor-petukhov", "Егор", "Петухов", "ПНП", [], "1994-02-28", "Россия", 9, 425, 100, 74, 78, 74, 74, 76, 75, "односторонний", [22, 28]),
  r("nikolai-polyakov", "Николай", "Поляков", "ПНП", ["ЛНП"], "2000-08-27", "Россия", 6, 133, 100, 68, 72, 73, 68, 72, 74, "двухсторонний", [2, 2]),
  r("sergei-popov", "Сергей", "Попов", "ЛНП", ["ЦТР"], "2000-03-27", "Россия", 5, 240, 100, 74, 74, 78, 74, 75, 77, "односторонний", [14]),
  r("seroukh", "Даниил", "Сероух", "ЛНП", [], "1997-10-06", "Россия", 4, 158, 100, 75, 77, 79, 71, 80, 79, "односторонний", [15]),
  r("utkin", "Дмитрий", "Уткин", "ЦТР", [], "2002-09-18", "Россия", 5, 83, 100, 70, 64, 72, 60, 65, 74, "двухсторонний", [1]),
  r("khafizov", "Тимур", "Хафизов", "ЦТР", [], "1998-06-20", "Россия", 9, 324, 100, 75, 70, 79, 76, 76, 77, "односторонний", [25, 30]),
  r("igor-shvyryov", "Игорь", "Швырев", "ЦТР", [], "1998-07-10", "Россия", 8, 184, 100, 62, 67, 80, 71, 65, 72, "односторонний", [18]),
  r("max-ellis", "Макс", "Эллис", "ПНП", [], "2000-01-18", "США", 1, 52, 100, 80, 77, 69, 70, 78, 79, "односторонний", [26]),
  r("matvei-babenko", "Матвей", "Бабенко", "ЛНП", ["ПНП"], "2005-10-28", "Россия", 2, 8, 100, 62, 65, 75, 66, 69, 76, "двухсторонний", [2, 3]),
  r("nikita-guslistov", "Никита", "Гуслистов", "ЦТР", [], "2002-05-30", "Россия", 6, 153, 100, 70, 77, 63, 64, 75, 75, "двухсторонний", [2]),
];
