import { createRosterRecord as r } from "./rosterRecord.js";

export const sochiDefenseRoster = [
  r("artyom-volkov", "Артем", "Волков", "ЗАЩ", [], "1997-04-25", "Россия", 12, 520, 100, 61, 73, 80, 78, 66, 76, "односторонний", [22]),
  r("cameron-lee", "Кэмерон", "Ли", "ЗАЩ", [], "1997-02-18", "Россия", 5, 199, 100, 70, 80, 77, 80, 75, 78, "односторонний", [25, 28]),
  r("anton-malyshev", "Антон", "Малышев", "ЗАЩ", [], "2000-02-27", "Россия", 6, 182, 100, 60, 70, 78, 76, 55, 74, "односторонний", [5]),
  r("machulin", "Василий", "Мачулин", "ЗАЩ", [], "2002-08-07", "Россия", 5, 178, 100, 71, 78, 81, 77, 73, 81, "односторонний", [10]),
  r("mokrushev", "Данил", "Мокрушев", "ЗАЩ", [], "1999-03-14", "Россия", 2, 72, 100, 55, 76, 73, 73, 70, 72, "двухсторонний", [10]),
  r("nikolayev", "Илья", "Николаев", "ЗАЩ", [], "2001-07-09", "Россия", 7, 190, 100, 61, 70, 77, 76, 70, 75, "односторонний", [9, 10, 10]),
  r("ilya-sushko", "Илья", "Сушко", "ЗАЩ", [], "1997-12-28", "Беларусь", 4, 83, 100, 57, 70, 68, 71, 60, 69, "двухсторонний", [2, 2]),
  r("khokhlov", "Илья", "Хохлов", "ЗАЩ", [], "1994-10-20", "Россия", 12, 487, 100, 68, 60, 79, 70, 72, 72, "односторонний", [4]),
  r("tsevelyov", "Всеволод", "Цевелев", "ЗАЩ", [], "2007-06-11", "Россия", 1, 3, 100, 57, 69, 60, 64, 55, 71, "трехсторонний", [0.5, 0.5, 0.5]),
  r("graham", "Джесси", "Грэм", "ЗАЩ", [], "1994-05-13", "Канада", 4, 186, 100, 75, 80, 73, 74, 82, 79, "односторонний", [30, 30]),
];
