import { createExternalRightsRecord as r } from "./recordFactory.js";

export const ahlRightsRecords = [
  r("AHL", "DYN", "Богдан", "Тринеев", "ЛНП", [], "trineyev", "2002-03-04", "Россия", 3, 53, 100, 75, 70, 80, 74, 74, 78, 2028),
  r("AHL", "CSK", "Егор", "Афанасьев", "ЛНП", ["ЦТР"], "afanasyev", "2001-01-23", "Россия", 2, 69, 100, 67, 71, 82, 75, 78, 78, 2026),
  r("AHL", "AVG", "Иван", "Мирошниченко", "ЛНП", [], "miroshnichenko", "2004-02-04", "Россия", 1, 23, 100, 77, 78, 79, 74, 77, 81, 2028),
  r("AHL", "AVT", "Виктор", "Неучев", "ЛНП", ["ПНП"], "neuchev", "2003-10-25", "Россия", 2, 58, 100, 74, 80, 73, 71, 76, 77, 2026),
  r("AHL", "SKA", "Максим", "Грошев", "ЗАЩ", ["ПНП"], "groshev", "2001-12-14", "Россия", 4, 108, 100, 65, 74, 82, 77, 76, 82, 2028),
  r("AHL", "DYN", "Никита", "Новиков", "ЗАЩ", [], "nikita-novikov", "2003-07-25", "Россия", 2, 94, 100, 70, 70, 81, 74, 74, 78, 2026),
  r("AHL", "SPM", "Никита", "Чибриков", "ЛНП", ["ПНП"], "chibrikov", "2003-02-16", "Россия", 3, 51, 100, 75, 82, 70, 67, 78, 80, 2028),
  r("AHL", "TOR", "Кирилл", "Кирсанов", "ЗАЩ", [], "kirsanov", "2002-09-19", "Россия", 5, 120, 100, 68, 70, 79, 75, 72, 77, 2027),
  r("AHL", "CSK", "Артем", "Дуда", "ЗАЩ", [], "duda", "2004-04-08", "Россия", 1, 14, 100, 74, 77, 76, 76, 76, 79, 2027),
  r("AHL", "AVG", "Глеб", "Трикозов", "ЛНП", ["ПНП"], "trikozov", "2004-08-12", "Россия", 2, 3, 100, 71, 76, 72, 69, 76, 78, 2027),
  r("AHL", "SPM", "Никита", "Сусуев", "ЛНП", ["ПНП"], "susuyev", "2005-02-06", "Россия", 3, 55, 100, 65, 70, 70, 63, 69, 76, 2028),
  r("AHL", "CSK", "Артем", "Грушников", "ЗАЩ", [], "grushnikov", "2003-03-20", "Россия", 0, 0, 100, 62, 67, 73, 73, 69, 77, 2026),
  r("AHL", "DMN", "Илья", "Соловьев", "ЗАЩ", [], "ilya-solovyov", "2000-07-20", "Беларусь", 1, 41, 100, 72, 72, 84, 77, 74, 78, 2027),
  r("AHL", "DMN", "Владислав", "Колячонок", "ЗАЩ", [], "kolyachonok", "2001-05-26", "Беларусь", 1, 46, 100, 70, 79, 77, 76, 72, 77, 2026),
  r("AHL", "DYN", "Иван", "Рябкин", "ЦТР", ["ЛНП"], "ryabkin", "2007-04-25", "Россия", 1, 2, 80, 70, 73, 78, 71, 74, 79, 2029),
  r("AHL", "AVT", "Даниил", "Гущин", "ЛНП", ["ПНП"], "gushchin", "2002-02-06", "Россия", 0, 0, 100, 76, 79, 70, 70, 78, 80, 2026),
];
