import { createRosterRecord as r } from "./rosterRecord.js";

export const ladaDefenseRoster = [
  r("maxim-belousov", "Максим", "Белоусов", "ЗАЩ", [], "2005-04-06", "Россия", 2, 54, 100, 66, 70, 69, 60, 64, 77, "двухсторонний", [2, 2]),
  r("daniil-bokun", "Даниил", "Бокун", "ЗАЩ", [], "1996-07-24", "Беларусь", 6, 212, 100, 65, 67, 74, 68, 70, 74, "односторонний", [12]),
  r("zemchyonok", "Артем", "Земченок", "ЗАЩ", [], "1991-06-24", "Россия", 14, 582, 100, 69, 75, 70, 74, 75, 75, "односторонний", [40]),
  r("cotton", "Алекс", "Коттон", "ЗАЩ", [], "2001-05-12", "Канада", 1, 63, 100, 73, 80, 76, 75, 77, 78, "односторонний", [25, 30, 30]),
  r("alexander-lukin", "Александр", "Лукин", "ЗАЩ", [], "2004-03-27", "Россия", 3, 48, 100, 54, 55, 69, 62, 60, 70, "двухсторонний", [0.5, 0.5]),
  r("nikolai-makarov", "Николай", "Макаров", "ЗАЩ", [], "2003-01-12", "Россия", 6, 91, 100, 60, 65, 74, 70, 70, 75, "двухсторонний", [10, 15]),
  r("yegor-morozov", "Егор", "Морозов", "ЗАЩ", [], "2002-09-30", "Россия", 2, 50, 100, 67, 62, 78, 68, 71, 74, "двухсторонний", [0.5, 1, 1]),
  r("vladislav-syomin", "Владислав", "Семин", "ЗАЩ", [], "1998-02-17", "Россия", 8, 249, 100, 65, 72, 80, 74, 70, 76, "односторонний", [17, 37, 37]),
  r("colby-williams", "Колби", "Уильямс", "ЗАЩ", [], "1995-01-26", "Канада", 4, 214, 100, 60, 77, 77, 76, 75, 76, "односторонний", [24]),
];
