import { createRosterRecord as r } from "./rosterRecord.js";

export const admiralDefenseRoster = [
  r("grman", "Марио", "Грман", "ЗАЩ", [], "1997-04-11", "Словакия", 4, 145, 100, 64, 78, 78, 80, 70, 77, "односторонний", [30]),
  r("deryabin", "Дмитрий", "Дерябин", "ЗАЩ", [], "1999-10-20", "Беларусь", 8, 244, 100, 59, 77, 78, 73, 72, 76, "односторонний", [10]),
  r("nikita-yefremov", "Никита", "Ефремов", "ЗАЩ", [], "2001-09-28", "Россия", 8, 234, 100, 65, 68, 77, 74, 70, 75, "односторонний", [2, 2, 2]),
  r("semyon-ibragimov", "Семен", "Ибрагимов", "ЗАЩ", [], "2003-02-27", "Россия", 5, 94, 100, 58, 70, 76, 68, 61, 74, "двухсторонний", [1, 1]),
  r("artyom-kudashov", "Артем", "Кудашов", "ЗАЩ", [], "2005-01-10", "Россия", 4, 132, 100, 58, 76, 65, 67, 61, 73, "двухсторонний", [1, 1]),
  r("ruslan-pedan", "Руслан", "Педан", "ЗАЩ", [], "1994-11-16", "Россия", 10, 311, 100, 62, 72, 72, 65, 70, 71, "односторонний", [10]),
  r("ruchkin", "Семен", "Ручкин", "ЗАЩ", [], "1996-11-04", "Россия", 8, 294, 100, 60, 80, 70, 73, 70, 74, "односторонний", [25]),
  r("solyannikov", "Георгий", "Солянников", "ЗАЩ", [], "1995-05-01", "Россия", 6, 249, 100, 78, 73, 80, 79, 75, 79, "односторонний", [35]),
  r("shepelev", "Александр", "Шепелев", "ЗАЩ", [], "1998-03-17", "Россия", 5, 146, 100, 64, 77, 73, 74, 71, 75, "односторонний", [8]),
  r("sulak", "Либор", "Шулак", "ЗАЩ", [], "1994-03-04", "Чехия", 7, 329, 100, 83, 71, 82, 73, 78, 80, "односторонний", [52, 55]),
];
