import { createRosterRecord as r } from "./rosterRecord.js";

export const admiralForwardRoster = [
  r("bryukvin", "Владимир", "Брюквин", "ЛНП", [], "1995-01-22", "Россия", 12, 519, 100, 71, 77, 74, 70, 74, 74, "односторонний", [3]),
  r("bulavchuk", "Оскар", "Булавчук", "ЛНП", [], "2003-11-10", "Россия", 2, 31, 100, 71, 63, 75, 71, 74, 74, "двухсторонний", [1, 1]),
  r("alexander-daryin", "Александр", "Дарьин", "ЛНП", [], "2000-08-16", "Россия", 7, 165, 100, 68, 76, 68, 70, 75, 76, "односторонний", [13, 13]),
  r("zavgorodny", "Дмитрий", "Завгородний", "ЛНП", ["ЦТР"], "2000-08-11", "Россия", 7, 262, 100, 75, 78, 72, 72, 76, 77, "односторонний", [20]),
  r("kara", "Владислав", "Кара", "ПНП", [], "1998-04-20", "Россия", 8, 320, 100, 73, 73, 77, 72, 75, 75, "односторонний", [5]),
  r("muranov", "Иван", "Муранов", "ПНП", [], "1999-10-06", "Россия", 9, 372, 100, 69, 72, 79, 75, 71, 75, "односторонний", [20, 20]),
  r("kyle-olson", "Кайл", "Олсон", "ЦТР", [], "1999-03-22", "Канада", 2, 66, 100, 79, 81, 72, 70, 76, 78, "односторонний", [30]),
  r("osnovin", "Вячеслав", "Основин", "ЦТР", [], "1994-03-05", "Россия", 14, 658, 100, 73, 75, 77, 74, 73, 75, "односторонний", [16]),
  r("soshnikov", "Никита", "Сошников", "ПНП", ["ЦТР"], "1993-10-14", "Россия", 10, 424, 100, 78, 77, 73, 73, 82, 79, "односторонний", [27, 40]),
  r("starkov", "Степан", "Старков", "ПНП", [], "1999-06-18", "Россия", 10, 350, 100, 75, 75, 77, 75, 76, 78, "односторонний", [45]),
  r("nikita-tertyshny", "Никита", "Тертышный", "ЛНП", [], "1998-06-11", "Россия", 7, 277, 100, 76, 79, 69, 64, 81, 78, "односторонний", [19]),
  r("dmytro-timashov", "Дмитро", "Тимашов", "ПНП", ["ЛНП"], "1996-10-01", "Швеция", 3, 64, 100, 69, 75, 74, 73, 73, 75, "односторонний", [12, 12]),
  r("usmanov", "Даниэль", "Усманов", "ЦТР", [], "2002-04-15", "Россия", 5, 107, 100, 70, 76, 70, 70, 73, 76, "двухсторонний", [1, 1]),
  r("chezganov", "Егор", "Чезганов", "ЛНП", ["ЦТР"], "2002-06-28", "Беларусь", 6, 54, 100, 72, 76, 74, 71, 74, 77, "двухсторонний", [2, 2, 5]),
  r("shestakov", "Аркадий", "Шестаков", "ЦТР", [], "1995-03-24", "Казахстан", 8, 398, 100, 72, 78, 76, 75, 74, 76, "односторонний", [36, 36]),
  r("pavel-shen", "Павел", "Шэн", "ЦТР", [], "1999-08-14", "Россия", 9, 312, 100, 72, 75, 80, 73, 75, 77, "односторонний", [20, 20]),
  r("ivan-fomin", "Иван", "Фомин", "ЛНП", ["ПНП"], "2006-12-04", "Россия", 1, 2, 100, 64, 77, 63, 61, 75, 75, "трехсторонний", [0.5, 0.5]),
];
